app/views/stocks/_form.html.erb

SELECT "users".* FROM "users"
---
      <%= form.label :user_id, "管理者" %>
      <%= form.collection_select :user_id, User.all, :id, :name, {} %>