app/controllers/inks_controller.rb

  def index
    @inks = Ink.all
---
SELECT "inks".* FROM "inks"

  def show
    @ink = Ink.find(params[:id])
---
SELECT "inks".* FROM "inks" WHERE "inks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_ink
      @ink = Ink.find(params[:id])
---
SELECT "inks".* FROM "inks" WHERE "inks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]