app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "created_at", "updated_at", "stage", "ink_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ロケーション1"], ["created_at", "2023-03-03 02:59:08.956703"], ["updated_at", "2023-03-03 02:59:08.956703"], ["stage", 1], ["ink_name", "K"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 1]]
---
  def destroy
    @location.destroy