app/controllers/stocks_controller.rb

  def index
    @stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"

  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save
---
INSERT INTO "stocks" ("ink_name", "color_type", "quantity", "user_id", "created_at", "updated_at", "stage") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ink_name", "K"], ["color_type", "黒"], ["quantity", 10], ["user_id", 1], ["created_at", "2023-03-05 18:47:50.174133"], ["updated_at", "2023-03-05 18:47:50.174133"], ["stage", 1]]

  def update
    respond_to do |format|
      if @stock.update(stock_params)
---
UPDATE "stocks" SET "quantity" = $1, "updated_at" = $2, "location_name" = $3 WHERE "stocks"."id" = $4  [["quantity", 15], ["updated_at", "2023-03-05 23:46:34.688066"], ["location_name", "ロケーション1"], ["id", 1]]

  def destroy
    @stock.destroy
---
DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 3]]

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]