app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "山田 太郎"], ["created_at", "2023-03-03 02:31:08.546384"], ["updated_at", "2023-03-03 02:31:08.546384"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "山田 太郎"], ["updated_at", "2023-03-03 02:43:42.492923"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)